      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR25DB05.                                            00005000
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:MURIEL ANDEIRGUETO                              *   00007100
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00007200
      *   DATA ....:30/05/2022                                      *   00007300
      *-------------------------------------------------------------*   00007400
      *   OBJETIVO:                                                 *   00007500
      *       FAZER UPDATE DOS REGISTRO DE UM TABELA.               *   00007608
      *                                                             *   00007700
      *                                                             *   00007800
      *-------------------------------------------------------------*   00007900
      *   ARQUIVOS...:                                              *   00008000
      *    DDNAME              I/O                 INCLUDE/BOOK     *   00008100
      *   IVAN.FUNC             I                  #BKFUNC----      *   00008200
      *-------------------------------------------------------------*   00008300
      *   MODULOS....:                             INCLUDE/BOOK     *   00008400
      *=============================================================*   00008500
                                                                        00008600
      *=============================================================*   00008700
       ENVIRONMENT                               DIVISION.              00008800
      *=============================================================*   00008900
                                                                        00009000
      *=============================================================*   00009100
       CONFIGURATION                               SECTION.             00009200
      *=============================================================*   00009300
       SPECIAL-NAMES.                                                   00009400
           DECIMAL-POINT IS COMMA.                                      00009500
                                                                        00009600
      *=============================================================*   00009700
       DATA                                      DIVISION.              00009800
      *=============================================================*   00009900
      *=============================================================*   00010000
       WORKING-STORAGE                             SECTION.             00020000
      *=============================================================*   00021000
                                                                        00021100
           EXEC SQL                                                     00021200
              INCLUDE #BKFUNC                                           00021300
           END-EXEC.                                                    00021400
                                                                        00021500
           EXEC SQL                                                     00021600
              INCLUDE SQLCA                                             00021700
           END-EXEC.                                                    00021800
                                                                        00021900
       77 WRK-SQLCODE         PIC -999.                                 00022000
                                                                        00023000
       01 WRK-ID.                                                       00024000
          05 FILLER              PIC X(10).                             00024100
          05 WRK-ID-AC           PIC 9(05).                             00024200
                                                                        00024300
       01 WRK-NOME.                                                     00024400
          05 FILLER              PIC X(10).                             00024500
          05 WRK-NOME-AC         PIC X(30).                             00024600
                                                                        00024700
       01 WRK-SETOR.                                                    00024800
          05 FILLER              PIC X(10).                             00024900
          05 WRK-SETOR-AC        PIC X(04).                             00025000
                                                                        00025100
       01 WRK-SALARIO.                                                  00025200
          05 FILLER              PIC X(10).                             00025300
          05 WRK-SALARIO-AC      PIC 9(08)V99.                          00025400
                                                                        00025500
       01 WRK-DATAADM.                                                  00025600
          05 FILLER              PIC X(10).                             00025700
          05 WRK-DATAADM-AC      PIC X(10).                             00025800
                                                                        00025900
       01 WRK-EMAIL.                                                    00026000
          05 FILLER              PIC X(10).                             00026100
          05 WRK-EMAIL-AC        PIC X(40).                             00026200
                                                                        00026300
      *=============================================================*   00026400
       PROCEDURE DIVISION.                                              00026500
      *=============================================================*   00026600
                                                                        00026700
      *-------------------------------------------------------------*   00026800
       0000-PRINCIPAL                           SECTION.                00026900
      *-------------------------------------------------------------*   00027000
                                                                        00027100
            PERFORM  1000-INICIAR.                                      00027200
             PERFORM  1200-TESTA-REGISTROS.                             00027300
            PERFORM  2000-PROCESSAR.                                    00027400
            PERFORM  3000-FINALIZAR.                                    00027500
            STOP RUN.                                                   00027600
                                                                        00027700
      *-------------------------------------------------------------*   00027800
       1000-INICIAR                             SECTION.                00027900
      *-------------------------------------------------------------*   00028000
                                                                        00028100
            ACCEPT WRK-ID.                                              00028200
            ACCEPT WRK-NOME.                                            00028300
            ACCEPT WRK-SETOR.                                           00028400
            ACCEPT WRK-SALARIO.                                         00028500
            ACCEPT WRK-DATAADM.                                         00028600
            ACCEPT WRK-EMAIL.                                           00028700
                                                                        00028800
      *-------------------------------------------------------------*   00028900
       1000-99-FIM.              EXIT.                                  00029000
      *-------------------------------------------------------------*   00029100
                                                                        00029200
      *-------------------------------------------------------------*   00029300
       1200-TESTA-REGISTROS                     SECTION.                00029400
      *-------------------------------------------------------------*   00029500
                                                                        00029600
            IF WRK-ID-AC NOT EQUAL 0 AND WRK-ID-AC IS NUMERIC           00029700
              CONTINUE                                                  00029800
            ELSE                                                        00029900
             DISPLAY 'CAMPO ID INVALIDO'                                00030000
              PERFORM 3000-FINALIZAR                                    00030100
               STOP RUN                                                 00030200
            END-IF.                                                     00030300
                                                                        00030400
      *-------------------------------------------------------------*   00030500
       1200-99-FIM.              EXIT.                                  00030600
      *-------------------------------------------------------------*   00030700
      *-------------------------------------------------------------*   00030800
       2000-PROCESSAR                           SECTION.                00030900
      *-------------------------------------------------------------*   00031000
                                                                        00032000
            MOVE WRK-ID-AC   TO DB2-ID.                                 00032100
                                                                        00032200
            EXEC SQL                                                    00032300
            SELECT ID,NOME,SETOR,SALARIO,DATAADM,EMAIL                  00032400
             INTO :DB2-ID,                                              00032500
                  :DB2-NOME,                                            00032600
                  :DB2-SETOR,                                           00032700
                  :DB2-SALARIO,                                         00032800
                  :DB2-DATAADM,                                         00032900
                  :DB2-EMAIL                                            00033002
             FROM IVAN.FUNC                                             00033100
              WHERE ID= :DB2-ID                                         00033200
            END-EXEC.                                                   00033300
                                                                        00033400
      *---NOME                                                          00033500
           IF WRK-NOME-AC        NOT EQUAL DB2-NOME                     00033600
              AND WRK-NOME-AC    NOT EQUAL SPACES                       00033700
            MOVE WRK-NOME-AC     TO DB2-NOME                            00033800
           END-IF.                                                      00033900
      *---SETOR                                                         00034000
           IF WRK-SETOR-AC       NOT EQUAL DB2-SETOR                    00034100
              AND WRK-SETOR-AC   NOT EQUAL SPACES                       00034200
            MOVE WRK-SETOR-AC    TO DB2-SETOR                           00034300
           END-IF.                                                      00034400
      *---SALARIO                                                       00034500
           IF WRK-SALARIO-AC     NOT EQUAL DB2-SALARIO                  00034600
              AND WRK-SALARIO-AC IS NUMERIC                             00034707
            MOVE WRK-SALARIO-AC  TO DB2-SALARIO                         00034800
           END-IF.                                                      00034900
      *---DATA                                                          00035000
           IF WRK-DATAADM-AC     NOT EQUAL DB2-NOME                     00035100
              AND WRK-DATAADM-AC NOT EQUAL SPACES                       00035200
            MOVE WRK-DATAADM-AC  TO DB2-DATAADM                         00035300
           END-IF.                                                      00035400
      *---EMAIL                                                         00035500
           IF WRK-EMAIL-AC       NOT EQUAL DB2-EMAIL                    00035600
              AND WRK-EMAIL-AC   NOT EQUAL SPACES                       00035700
            MOVE WRK-EMAIL-AC    TO DB2-EMAIL                           00035800
           END-IF.                                                      00035900
                                                                        00036000
                                                                        00037100
            EVALUATE SQLCODE                                            00037200
             WHEN 0                                                     00037300
              PERFORM 2100-UPDATE                                       00037400
              DISPLAY 'DADOS ATUALIZADOS'                               00037500
              DISPLAY 'ID..... ' DB2-ID                                 00037600
              DISPLAY 'NOME... ' DB2-NOME                               00037700
              DISPLAY 'SETOR.. ' DB2-SETOR                              00037800
              DISPLAY 'SALARIO ' DB2-SALARIO                            00037900
              DISPLAY 'DATAADM ' DB2-DATAADM                            00038000
             WHEN -181                                                  00038100
              DISPLAY 'DATA FORMATO ERRADO ' DB2-ID                     00038200
             WHEN OTHER                                                 00038300
               MOVE SQLCODE TO WRK-SQLCODE                              00038400
               DISPLAY 'ERRO NA LEITURA ' WRK-SQLCODE                   00038500
            END-EVALUATE.                                               00038600
                                                                        00038700
      *-------------------------------------------------------------*   00038800
       2000-99-FIM.              EXIT.                                  00038900
      *-------------------------------------------------------------*   00039000
      *-------------------------------------------------------------*   00039100
       2100-UPDATE                              SECTION.                00039200
      *-------------------------------------------------------------*   00039300
            EXEC SQL                                                    00039400
             UPDATE IVAN.FUNC SET NOME    = :DB2-NOME,                  00039502
                                  SETOR   = :DB2-SETOR,                 00039603
                                  SALARIO = :DB2-SALARIO,               00039703
                                  DATAADM = :DB2-DATAADM,               00039803
                                  EMAIL   = :DB2-EMAIL                  00039903
                          WHERE ID= :DB2-ID                             00040004
            END-EXEC.                                                   00040100
      *-------------------------------------------------------------*   00040400
       2100-99-FIM.              EXIT.                                  00040500
      *-------------------------------------------------------------*   00040600
                                                                        00040700
      *-------------------------------------------------------------*   00040800
       3000-FINALIZAR                           SECTION.                00040900
      *-------------------------------------------------------------*   00041000
                                                                        00041100
              DISPLAY ' -----FIM DO PROGRAMA----- '.                    00041200
                                                                        00041300
      *-------------------------------------------------------------*   00041400
       3000-99-FIM.              EXIT.                                  00041500
      *-------------------------------------------------------------*   00041600
      *-------------------------------------------------------------*   00041700
       9000-TRATAERROS                              SECTION.            00041800
      *-------------------------------------------------------------*   00041900
                                                                        00042000
      *-------------------------------------------------------------*   00042100
       9000-99-FIM.              EXIT.                                  00043000
      *-------------------------------------------------------------*   00050000
