      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR25DB04.                                            00005000
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:MURIEL ANDEIRGUETO                              *   00007100
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00007200
      *   DATA ....:08/06/2022                                      *   00007300
      *-------------------------------------------------------------*   00007400
      *   OBJETIVO:                                                 *   00007500
      *       DELETAR REGISTRO DE UM TABELA.                        *   00007600
      *                                                             *   00007700
      *                                                             *   00007800
      *-------------------------------------------------------------*   00007900
      *   ARQUIVOS...:                                              *   00008000
      *    DDNAME              I/O                 INCLUDE/BOOK     *   00008100
      *   IVAN.FUNC             I                  #BKFUNC----      *   00008200
      *-------------------------------------------------------------*   00008300
      *   MODULOS....:                             INCLUDE/BOOK     *   00008400
      *=============================================================*   00008500
                                                                        00008600
      *=============================================================*   00008700
       ENVIRONMENT                               DIVISION.              00008800
      *=============================================================*   00008900
                                                                        00009000
      *=============================================================*   00009100
       CONFIGURATION                               SECTION.             00009200
      *=============================================================*   00009300
       SPECIAL-NAMES.                                                   00009400
           DECIMAL-POINT IS COMMA.                                      00009500
                                                                        00009600
      *=============================================================*   00009700
       DATA                                      DIVISION.              00009800
      *=============================================================*   00009900
      *=============================================================*   00010000
       WORKING-STORAGE                             SECTION.             00020000
      *=============================================================*   00021000
                                                                        00021100
           EXEC SQL                                                     00021200
              INCLUDE #BKFUNC                                           00021300
           END-EXEC.                                                    00021400
                                                                        00021500
           EXEC SQL                                                     00021600
              INCLUDE SQLCA                                             00021700
           END-EXEC.                                                    00021800
                                                                        00021900
       77 WRK-ID              PIC 9(05) VALUE ZEROES.                   00022000
       77 WRK-SQLCODE         PIC -999.                                 00023000
       77 WRK-NULL-EMAIL      PIC S9(4) COMP.                           00026300
                                                                        00026500
      *=============================================================*   00026600
       PROCEDURE DIVISION.                                              00026700
      *=============================================================*   00026800
                                                                        00026900
      *-------------------------------------------------------------*   00027000
       0000-PRINCIPAL                           SECTION.                00027100
      *-------------------------------------------------------------*   00027200
                                                                        00027300
            PERFORM  1000-INICIAR.                                      00027400
            PERFORM  2000-PROCESSAR.                                    00027600
            PERFORM  3000-FINALIZAR.                                    00027700
            STOP RUN.                                                   00027800
                                                                        00027900
      *-------------------------------------------------------------*   00028000
       1000-INICIAR                             SECTION.                00028100
      *-------------------------------------------------------------*   00028200
                                                                        00028300
            ACCEPT WRK-ID FROM SYSIN.                                   00028400
                                                                        00029000
      *-------------------------------------------------------------*   00029100
       1000-99-FIM.              EXIT.                                  00029200
      *-------------------------------------------------------------*   00029300
                                                                        00029400
      *-------------------------------------------------------------*   00031500
       2000-PROCESSAR                           SECTION.                00031600
      *-------------------------------------------------------------*   00031700
                                                                        00031800
            MOVE WRK-ID TO DB2-ID.                                      00031900
                                                                        00032000
            EXEC SQL                                                    00032100
              DELETE FROM IVAN.FUNC WHERE ID = :DB2-ID                  00032200
            END-EXEC.                                                   00032300
                                                                        00032400
            EVALUATE SQLCODE                                            00032500
             WHEN 0                                                     00032600
              DISPLAY 'REGISTRO DELETADO.' WRK-ID                       00032700
             WHEN 100                                                   00032800
              DISPLAY 'NAO ENCONTRADO ' DB2-ID                          00032900
             WHEN OTHER                                                 00033000
              MOVE SQLCODE TO WRK-SQLCODE                               00033100
               DISPLAY 'ERRO NA LEITURA ' WRK-SQLCODE                   00033200
             END-EVALUATE.                                              00033300
                                                                        00033400
      *-------------------------------------------------------------*   00035200
       2000-99-FIM.              EXIT.                                  00035300
      *-------------------------------------------------------------*   00035400
                                                                        00035500
      *-------------------------------------------------------------*   00035600
       3000-FINALIZAR                           SECTION.                00035700
      *-------------------------------------------------------------*   00035800
                                                                        00035900
              DISPLAY ' -----FIM DO PROGRAMA----- '.                    00036000
                                                                        00037000
      *-------------------------------------------------------------*   00038000
       3000-99-FIM.              EXIT.                                  00039000
      *-------------------------------------------------------------*   00039100
      *-------------------------------------------------------------*   00039200
       9000-TRATAERROS                              SECTION.            00039300
      *-------------------------------------------------------------*   00039400
                                                                        00039500
      *-------------------------------------------------------------*   00039600
       9000-99-FIM.              EXIT.                                  00039700
      *-------------------------------------------------------------*   00039800
