      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR25DB03.                                            00005004
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:MURIEL ANDEIRGUETO                              *   00007100
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00007200
      *   DATA ....:30/05/2022                                      *   00007300
      *-------------------------------------------------------------*   00007400
      *   OBJETIVO:                                                 *   00007500
      *       INSERIR REGISTRO DE UM TABELA.                        *   00007603
      *                                                             *   00007700
      *                                                             *   00007800
      *-------------------------------------------------------------*   00007900
      *   ARQUIVOS...:                                              *   00008000
      *    DDNAME              I/O                 INCLUDE/BOOK     *   00008100
      *   IVAN.FUNC             I                  #BKFUNC----      *   00008200
      *-------------------------------------------------------------*   00008300
      *   MODULOS....:                             INCLUDE/BOOK     *   00008400
      *=============================================================*   00008500
                                                                        00008600
      *=============================================================*   00008700
       ENVIRONMENT                               DIVISION.              00008800
      *=============================================================*   00008900
                                                                        00009000
      *=============================================================*   00009100
       CONFIGURATION                               SECTION.             00009200
      *=============================================================*   00009300
       SPECIAL-NAMES.                                                   00009400
           DECIMAL-POINT IS COMMA.                                      00009500
                                                                        00009600
      *=============================================================*   00009700
       DATA                                      DIVISION.              00009800
      *=============================================================*   00009900
      *=============================================================*   00010000
       WORKING-STORAGE                             SECTION.             00020000
      *=============================================================*   00021000
                                                                        00021100
           EXEC SQL                                                     00021200
              INCLUDE #BKFUNC                                           00021300
           END-EXEC.                                                    00021400
                                                                        00021500
           EXEC SQL                                                     00021600
              INCLUDE SQLCA                                             00021700
           END-EXEC.                                                    00021800
                                                                        00021900
       77 WRK-SQLCODE         PIC -999.                                 00023000
                                                                        00024101
       01 WRK-ID.                                                       00024202
          05 FILLER              PIC X(10).                             00024306
          05 WRK-ID-AC           PIC 9(05).                             00024406
                                                                        00024502
       01 WRK-NOME.                                                     00024605
          05 FILLER              PIC X(10).                             00024706
          05 WRK-NOME-AC         PIC X(30).                             00024806
                                                                        00024902
       01 WRK-SETOR.                                                    00025005
          05 FILLER              PIC X(10).                             00025106
          05 WRK-SETOR-AC        PIC X(04).                             00025206
                                                                        00025302
       01 WRK-SALARIO.                                                  00025405
          05 FILLER              PIC X(10).                             00025506
          05 WRK-SALARIO-AC      PIC 9(08)V99.                          00025606
                                                                        00025702
       01 WRK-DATAADM.                                                  00025805
          05 FILLER              PIC X(10).                             00025906
          05 WRK-DATAADM-AC      PIC X(10).                             00026006
                                                                        00026102
       01 WRK-EMAIL.                                                    00026205
          05 FILLER              PIC X(10).                             00026306
          05 WRK-EMAIL-AC        PIC X(40).                             00026406
                                                                        00026500
      *=============================================================*   00026600
       PROCEDURE DIVISION.                                              00026700
      *=============================================================*   00026800
                                                                        00026900
      *-------------------------------------------------------------*   00027000
       0000-PRINCIPAL                           SECTION.                00027100
      *-------------------------------------------------------------*   00027200
                                                                        00027300
            PERFORM  1000-INICIAR.                                      00027400
             PERFORM  1200-TESTA-REGISTROS.                             00027508
            PERFORM  2000-PROCESSAR.                                    00027608
            PERFORM  3000-FINALIZAR.                                    00027708
            STOP RUN.                                                   00027808
                                                                        00027908
      *-------------------------------------------------------------*   00028008
       1000-INICIAR                             SECTION.                00028108
      *-------------------------------------------------------------*   00028208
                                                                        00028308
            ACCEPT WRK-ID.                                              00028408
            ACCEPT WRK-NOME.                                            00028508
            ACCEPT WRK-SETOR.                                           00028608
            ACCEPT WRK-SALARIO.                                         00028708
            ACCEPT WRK-DATAADM.                                         00028808
            ACCEPT WRK-EMAIL.                                           00028908
                                                                        00029302
      *-------------------------------------------------------------*   00029400
       1000-99-FIM.              EXIT.                                  00029500
      *-------------------------------------------------------------*   00029600
                                                                        00029700
      *-------------------------------------------------------------*   00029808
       1200-TESTA-REGISTROS                     SECTION.                00029910
      *-------------------------------------------------------------*   00030008
                                                                        00030108
            IF WRK-ID-AC NOT EQUAL 0 AND WRK-ID-AC IS NUMERIC           00030413
              CONTINUE                                                  00030514
            ELSE                                                        00030614
             DISPLAY 'CAMPO ID INVALIDO'                                00030708
              PERFORM 3000-FINALIZAR                                    00030808
               STOP RUN                                                 00030908
            END-IF.                                                     00031008
                                                                        00031208
      *-------------------------------------------------------------*   00031708
       1200-99-FIM.              EXIT.                                  00031808
      *-------------------------------------------------------------*   00031908
      *-------------------------------------------------------------*   00032000
       2000-PROCESSAR                           SECTION.                00032100
      *-------------------------------------------------------------*   00032200
                                                                        00032300
            MOVE WRK-ID-AC      TO DB2-ID.                              00032406
            MOVE WRK-NOME-AC    TO DB2-NOME.                            00032506
            MOVE WRK-SETOR-AC   TO DB2-SETOR.                           00032606
            MOVE WRK-SALARIO-AC TO DB2-SALARIO.                         00032706
            MOVE WRK-DATAADM-AC TO DB2-DATAADM.                         00032806
            MOVE WRK-EMAIL-AC   TO DB2-EMAIL.                           00032906
                                                                        00033000
            EXEC SQL                                                    00033100
             INSERT INTO                                                00033204
              IVAN.FUNC (ID,NOME,SETOR,SALARIO,DATAADM,EMAIL)           00033304
             VALUES(:DB2-ID,                                            00033404
                    :DB2-NOME,                                          00033504
                    :DB2-SETOR,                                         00033604
                    :DB2-SALARIO,                                       00033704
                    :DB2-DATAADM,                                       00033804
                    :DB2-EMAIL)                                         00033904
            END-EXEC.                                                   00034003
                                                                        00034103
            EVALUATE SQLCODE                                            00034200
             WHEN 0                                                     00034300
              DISPLAY 'DADOS GRAVADOS'                                  00034404
              DISPLAY 'ID..... ' DB2-ID                                 00034504
              DISPLAY 'NOME... ' DB2-NOME                               00034604
              DISPLAY 'SETOR.. ' DB2-SETOR                              00034704
              DISPLAY 'SALARIO ' DB2-SALARIO                            00034804
              DISPLAY 'DATAADM ' DB2-DATAADM                            00034904
             WHEN -181                                                  00035004
              DISPLAY 'DATA FORMATO ERRADO ' DB2-ID                     00035104
             WHEN OTHER                                                 00035204
               MOVE SQLCODE TO WRK-SQLCODE                              00035304
               DISPLAY 'ERRO NA LEITURA ' WRK-SQLCODE                   00035404
            END-EVALUATE.                                               00035504
                                                                        00035600
      *-------------------------------------------------------------*   00035700
       2000-99-FIM.              EXIT.                                  00035800
      *-------------------------------------------------------------*   00035900
                                                                        00036000
      *-------------------------------------------------------------*   00036100
       3000-FINALIZAR                           SECTION.                00036200
      *-------------------------------------------------------------*   00036300
                                                                        00036400
              DISPLAY ' -----FIM DO PROGRAMA----- '.                    00037000
                                                                        00038000
      *-------------------------------------------------------------*   00038100
       3000-99-FIM.              EXIT.                                  00039000
      *-------------------------------------------------------------*   00039100
      *-------------------------------------------------------------*   00040000
       9000-TRATAERROS                              SECTION.            00041000
      *-------------------------------------------------------------*   00042000
                                                                        00043000
      *-------------------------------------------------------------*   00043100
       9000-99-FIM.              EXIT.                                  00044000
      *-------------------------------------------------------------*   00045000
