      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR25DB09.                                            00005000
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:MURIEL ANDEIRGUETO                              *   00007100
      *   ANALISTA.:IVAN PETRUCCI                  - INSTRUTOR      *   00007200
      *   DATA ....:17/06/2022                                      *   00007300
      *-------------------------------------------------------------*   00007400
      *   OBJETIVO:                                                 *   00007500
      *       LER REGISTRO DE UM TABELA E FAZER VERIFICACAO         *   00007600
      *       PARA RECEBIMENTO DE MAIS DE 1 REGISTRO UNIC E         *   00007716
      *       REGISTRO NAO CADASTRADOS NA TABELA                    *   00007816
      *-------------------------------------------------------------*   00007900
      *   ARQUIVOS...:                                              *   00008000
      *    DDNAME              I/O                 INCLUDE/BOOK     *   00008100
      *   IVAN.FUNC             I                  #BKFUNC----      *   00008200
      *-------------------------------------------------------------*   00008300
      *   MODULOS....:                             INCLUDE/BOOK     *   00008400
      *=============================================================*   00008500
                                                                        00008600
      *=============================================================*   00008700
       ENVIRONMENT                               DIVISION.              00008800
      *=============================================================*   00008900
                                                                        00009000
      *=============================================================*   00009100
       CONFIGURATION                               SECTION.             00009200
      *=============================================================*   00009300
       SPECIAL-NAMES.                                                   00009400
           DECIMAL-POINT IS COMMA.                                      00009500
                                                                        00009600
      *=============================================================*   00009700
       DATA                                      DIVISION.              00009800
      *=============================================================*   00009900
      *=============================================================*   00010000
       WORKING-STORAGE                             SECTION.             00020000
      *=============================================================*   00021000
                                                                        00021100
           EXEC SQL                                                     00021200
              INCLUDE #BKFUNC                                           00021300
           END-EXEC.                                                    00021400
                                                                        00021500
           EXEC SQL                                                     00021600
              INCLUDE SQLCA                                             00021700
           END-EXEC.                                                    00021800
                                                                        00021900
       77 WRK-ID              PIC 9(05) VALUE ZEROES.                   00022000
       77 WRK-SQLCODE         PIC -999.                                 00023000
       77 WRK-NULL-EMAIL      PIC S9(4) COMP.                           00024000
                                                                        00025000
      *=============================================================*   00026000
       PROCEDURE DIVISION.                                              00026100
      *=============================================================*   00026200
                                                                        00026300
      *-------------------------------------------------------------*   00026400
       0000-PRINCIPAL                           SECTION.                00026500
      *-------------------------------------------------------------*   00026600
            PERFORM  1000-INICIAR.                                      00026800
            IF SQLCODE EQUAL 0                                          00026911
             PERFORM  2000-PROCESSAR                                    00027012
            END-IF.                                                     00027111
             PERFORM  3000-FINALIZAR.                                   00027212
            GOBACK.                                                     00027414
      *-------------------------------------------------------------*   00027500
       0000-99-FIM.              EXIT.                                  00027600
      *-------------------------------------------------------------*   00027700
                                                                        00027800
      *-------------------------------------------------------------*   00027900
       1000-INICIAR                             SECTION.                00028000
      *-------------------------------------------------------------*   00028100
            ACCEPT WRK-ID FROM SYSIN.                                   00028200
             PERFORM 1100-LER-AQRQUIVO.                                 00028300
      *-------------------------------------------------------------*   00028400
       1000-99-FIM.              EXIT.                                  00028500
      *-------------------------------------------------------------*   00028600
                                                                        00028700
      *-------------------------------------------------------------*   00028800
       1100-LER-AQRQUIVO                        SECTION.                00028900
      *-------------------------------------------------------------*   00029000
            MOVE WRK-ID TO DB2-ID.                                      00029100
                                                                        00029200
            EXEC SQL                                                    00029300
            SELECT ID,NOME,SETOR,SALARIO,DATAADM,EMAIL                  00029400
             INTO :DB2-ID,                                              00029500
                  :DB2-NOME,                                            00029600
                  :DB2-SETOR,                                           00029700
                  :DB2-SALARIO,                                         00029800
                  :DB2-DATAADM,                                         00029900
                  :DB2-EMAIL     :WRK-NULL-EMAIL                        00030000
             FROM IVAN.FUNC                                             00030100
              WHERE ID= :DB2-ID                                         00030200
            END-EXEC.                                                   00030400
                                                                        00030500
            DISPLAY ' SQLWARN0.. ' SQLWARN0.                            00030616
            DISPLAY ' SQLSTATE.. ' SQLSTATE.                            00030716
                                                                        00030800
            IF (SQLCODE  NOT EQUAL ZEROS AND 100) OR                    00030900
               (SQLWARN0 EQUAL 'W')                                     00031000
                 MOVE SQLCODE TO  WRK-SQLCODE                           00031100
                 DISPLAY ' ERRO NA LEITURA ' WRK-SQLCODE                00031216
            END-IF.                                                     00031400
                                                                        00031500
            IF (SQLCODE EQUAL 100)                                      00031600
               DISPLAY ' NAO ENCONTRADO ' DB2-ID                        00031716
            END-IF.                                                     00032000
      *-------------------------------------------------------------*   00032100
       1100-99-FIM.              EXIT.                                  00032200
      *-------------------------------------------------------------*   00032300
                                                                        00032400
      *-------------------------------------------------------------*   00032500
       2000-PROCESSAR                           SECTION.                00032600
      *-------------------------------------------------------------*   00032700
            DISPLAY ' ID....... ' DB2-ID                                00034116
            DISPLAY ' NOME..... ' DB2-NOME                              00034216
            DISPLAY ' SETOR.... ' DB2-SETOR                             00034316
            DISPLAY ' SALARIO.. ' DB2-SALARIO                           00034416
            DISPLAY ' DATAADM.. ' DB2-DATAADM                           00034516
             IF WRK-NULL-EMAIL = 0                                      00034600
                DISPLAY ' EMAIL. ' DB2-EMAIL                            00034716
             ELSE                                                       00034800
                DISPLAY ' EMAIL NULO'                                   00034916
             END-IF.                                                    00035000
      *-------------------------------------------------------------*   00037200
       2000-99-FIM.              EXIT.                                  00037300
      *-------------------------------------------------------------*   00037400
                                                                        00037500
      *-------------------------------------------------------------*   00037600
       3000-FINALIZAR                           SECTION.                00037700
      *-------------------------------------------------------------*   00037800
             DISPLAY ' -----FIM DO PROGRAMA----- '.                     00038000
      *-------------------------------------------------------------*   00038200
       3000-99-FIM.              EXIT.                                  00039000
      *-------------------------------------------------------------*   00039100
                                                                        00039200
      *-------------------------------------------------------------*   00040000
       9000-TRATAERROS                              SECTION.            00041000
      *-------------------------------------------------------------*   00042000
                                                                        00043000
      *-------------------------------------------------------------*   00043100
       9000-99-FIM.              EXIT.                                  00044000
      *-------------------------------------------------------------*   00045000
