      *=============================================================*   00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=============================================================*   00003000
                                                                        00004000
       PROGRAM-ID. FR25DB02.                                            00005023
                                                                        00006000
      *=============================================================*   00007000
      *   AUTOR....:MURIEL ANDRIGUETO                               *   00007123
      *   ANALISTA.:IVAN PETRUCCI                                   *   00007226
      *   DATA ....:30/05/2022                                      *   00007300
      *-------------------------------------------------------------*   00007400
      *   OBJETIVO:LER DE TODOS OS REGISTROS DE UMA TABELA,         *   00007523
      *   MOSTRAR ESSES REGISTRO E CALCULAR A SOMA E MEDIA DOS      *   00007623
      *   SALARIOS.                                                 *   00007723
      *                                                             *   00007800
      *-------------------------------------------------------------*   00007900
      *   BANCO DE DADOS..:                                         *   00008029
      *     IVAN.FUNC          I/O                 INCLUDE/BOOK     *   00008129
      *                         I                  #BKFUNC----      *   00008229
      *-------------------------------------------------------------*   00008300
      *   MODULOS....:                             INCLUDE/BOOK     *   00008400
      *=============================================================*   00008500
                                                                        00008600
      *=============================================================*   00008700
       ENVIRONMENT                               DIVISION.              00008800
      *=============================================================*   00008900
                                                                        00009000
      *=============================================================*   00009100
       CONFIGURATION                               SECTION.             00009200
      *=============================================================*   00009300
       SPECIAL-NAMES.                                                   00009400
           DECIMAL-POINT IS COMMA.                                      00009500
                                                                        00009600
      *=============================================================*   00009700
       DATA                                      DIVISION.              00009800
      *=============================================================*   00009900
      *=============================================================*   00010000
       WORKING-STORAGE                             SECTION.             00011000
      *=============================================================*   00020000
                                                                        00021000
           EXEC SQL                                                     00022000
              INCLUDE #BKFUNC                                           00023000
           END-EXEC.                                                    00023100
                                                                        00023200
           EXEC SQL                                                     00023300
              INCLUDE SQLCA                                             00023400
           END-EXEC.                                                    00023500
                                                                        00023600
           EXEC SQL                                                     00023700
              DECLARE CFUNC CURSOR FOR                                  00023800
               SELECT * FROM IVAN.FUNC                                  00023901
                ORDER BY ID                                             00024018
           END-EXEC.                                                    00024100
                                                                        00024200
       77 WRK-REGLIDOS        PIC 9(03).                                00024305
       77 WRK-SALARIO-ACUM    PIC S9(8)V9(2) COMP.                      00024629
       77 WRK-MAIOR-SALARIO   PIC S9(8)V9(2) COMP.                      00024729
       77 WRK-MEDIA           PIC S9(8)V9(2) COMP.                      00024926
       77 WRK-ID              PIC 9(05) VALUE ZEROES.                   00025018
       77 WRK-SQLCODE         PIC -999.                                 00025118
       77 WRK-NULL-EMAIL      PIC S9(4) COMP.                           00025218
                                                                        00025318
      *=============================================================*   00025418
       PROCEDURE DIVISION.                                              00026000
      *=============================================================*   00026100
                                                                        00026200
      *-------------------------------------------------------------*   00026300
       0000-PRINCIPAL                           SECTION.                00026400
      *-------------------------------------------------------------*   00026500
              PERFORM  1000-INICIAR.                                    00026736
               PERFORM 1100-VERIFICA-DB.                                00026836
              PERFORM  2000-PROCESSAR UNTIL SQLCODE EQUAL 100.          00026936
              PERFORM  3000-FINALIZAR.                                  00027036
              STOP RUN.                                                 00027136
      *-------------------------------------------------------------*   00027336
       0000-99-FIM.              EXIT.                                  00027436
      *-------------------------------------------------------------*   00027536
      *-------------------------------------------------------------*   00027700
       1000-INICIAR                             SECTION.                00027800
      *-------------------------------------------------------------*   00027900
              EXEC SQL                                                  00028036
                 OPEN CFUNC                                             00028136
              END-EXEC.                                                 00028236
      *-------------------------------------------------------------*   00029329
       1000-99-FIM.              EXIT.                                  00029500
      *-------------------------------------------------------------*   00029629
      *-------------------------------------------------------------*   00029836
       1100-VERIFICA-DB                       SECTION.                  00029936
      *-------------------------------------------------------------*   00030036
              EVALUATE SQLCODE                                          00030436
               WHEN 0                                                   00030536
                 PERFORM 1200-LER-FUNC                                  00030636
               WHEN 100                                                 00030736
                 DISPLAY 'SEM FUNCIONARIO'                              00030836
               WHEN OTHER                                               00030936
                 MOVE SQLCODE TO WRK-SQLCODE                            00031036
                 DISPLAY 'ERRO ' WRK-SQLCODE ' NO OPEN DO CURSOR.'      00031136
                 MOVE 200 TO RETURN-CODE                                00031236
                 STOP RUN                                               00031336
              END-EVALUATE.                                             00031436
      *-------------------------------------------------------------*   00031536
       1100-99-FIM.              EXIT.                                  00031636
      *-------------------------------------------------------------*   00031736
      *-------------------------------------------------------------*   00031836
       1200-LER-FUNC                                SECTION.            00031936
      *-------------------------------------------------------------*   00032036
              EXEC SQL                                                  00032136
               FETCH CFUNC                                              00032236
                INTO :DB2-ID,                                           00032336
                     :DB2-NOME,                                         00032436
                     :DB2-SETOR,                                        00032536
                     :DB2-SALARIO,                                      00032636
                     :DB2-DATAADM,                                      00032736
                     :DB2-EMAIL     :WRK-NULL-EMAIL                     00032836
              END-EXEC.                                                 00032936
              PERFORM 1300-VERIFICA-REG.                                00033036
      *-------------------------------------------------------------*   00034136
       1200-99-FIM.              EXIT.                                  00034236
      *-------------------------------------------------------------*   00034336
      *-------------------------------------------------------------*   00034436
       1300-VERIFICA-REG                            SECTION.            00034536
      *-------------------------------------------------------------*   00034636
              EVALUATE SQLCODE                                          00034736
               WHEN 0                                                   00034836
                 ADD 1 TO WRK-REGLIDOS                                  00034936
                  ADD DB2-SALARIO TO WRK-SALARIO-ACUM                   00035036
                   CONTINUE                                             00036036
               WHEN 100                                                 00036136
                 DISPLAY '.....................'                        00036240
                 DISPLAY 'FINAL DE ARQUIVO'                             00036339
               WHEN OTHER                                               00036436
                 MOVE SQLCODE TO WRK-SQLCODE                            00036536
                  DISPLAY 'ERRO NA LEITURA ' WRK-SQLCODE                00036636
              END-EVALUATE.                                             00036736
              PERFORM 2200-CALCULO-SALARIO.                             00036838
      *-------------------------------------------------------------*   00036936
       1300-99-FIM.              EXIT.                                  00037036
      *-------------------------------------------------------------*   00037136
      *-------------------------------------------------------------*   00037200
       2000-PROCESSAR                           SECTION.                00037300
      *-------------------------------------------------------------*   00037400
              DISPLAY '.....................'                           00037531
              DISPLAY 'ID..... ' DB2-ID                                 00037603
              DISPLAY 'NOME... ' DB2-NOME                               00037703
              DISPLAY 'SETOR.. ' DB2-SETOR                              00037803
              DISPLAY 'SALARIO ' DB2-SALARIO                            00037903
              DISPLAY 'DATAADM ' DB2-DATAADM                            00038003
              IF WRK-NULL-EMAIL = 0                                     00038136
                DISPLAY 'EMAIL. ' DB2-EMAIL                             00038236
              ELSE                                                      00038336
                DISPLAY '--SEM EMAIL '                                  00038436
              END-IF.                                                   00038536
              PERFORM 1200-LER-FUNC.                                    00038637
      *-------------------------------------------------------------*   00038728
       2000-99-FIM.              EXIT.                                  00038802
      *-------------------------------------------------------------*   00039028
      *-------------------------------------------------------------*   00044736
       2200-CALCULO-SALARIO                         SECTION.            00044836
      *-------------------------------------------------------------*   00044936
              IF DB2-SALARIO IS GREATER WRK-MAIOR-SALARIO               00045036
                MOVE DB2-SALARIO TO WRK-MAIOR-SALARIO                   00045136
              END-IF.                                                   00045236
      *-------------------------------------------------------------*   00045836
       2200-99-FIM.              EXIT.                                  00045936
      *-------------------------------------------------------------*   00046036
      *-------------------------------------------------------------*   00046227
       3000-FINALIZAR                               SECTION.            00046327
      *-------------------------------------------------------------*   00046427
              EXEC SQL                                                  00046727
                CLOSE CFUNC                                             00046827
              END-EXEC.                                                 00046927
              DISPLAY '   '                                             00047033
              DISPLAY 'REGISTROS LIDOS.......' WRK-REGLIDOS.            00047127
              DISPLAY 'MAIOR SALARIO.........' WRK-MAIOR-SALARIO.       00047227
              DISPLAY 'SALARIO ACUMULADO.....' WRK-SALARIO-ACUM.        00047329
              DIVIDE WRK-SALARIO-ACUM BY WRK-REGLIDOS                   00047429
                                 GIVING WRK-MEDIA.                      00047532
              DISPLAY 'MEDIA DOS SALARIOS....' WRK-MEDIA.               00047635
              DISPLAY '-----FIM DO PROGRAMA----- '.                     00047733
      *-------------------------------------------------------------*   00047827
       3000-99-FIM.              EXIT.                                  00047927
      *-------------------------------------------------------------*   00048027
      *-------------------------------------------------------------*   00048225
       9000-TRATAERROS                              SECTION.            00048319
      *-------------------------------------------------------------*   00048419
                                                                        00048500
      *-------------------------------------------------------------*   00049025
       9000-99-FIM.              EXIT.                                  00050000
      *-------------------------------------------------------------*   00060025
