      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
                                                                        00031004
       PROGRAM-ID. FR25CB06.                                            00040000
                                                                        00050000
      *====================================================*            00051004
      *  AUTOR: MURIEL RICARDO                             *            00052004
      *  EMPRESA: FOURSYS                                  *            00053004
      *----------------------------------------------------*            00054004
      *  DATA: 29/04/2022                                  *            00055004
      *  OBJETIVO: RECEBER AS VARIAVEIS EM LINHA           *            00060004
      *            DA SISYN UTILIZAR O FILLER              *            00070004
      *            PARA PULAR DADOS E EXIBI-LOS            *            00080004
      *                                                    *            00081004
      *====================================================*            00090004
                                                                        00091000
      *====================================================*            00092004
       ENVIRONMENT                               DIVISION.              00093000
      *====================================================*            00094004
                                                                        00095000
      *====================================================*            00096004
       DATA                                      DIVISION.              00097000
      *====================================================*            00098004
       WORKING-STORAGE                            SECTION.              00099000
      *----------- LAYOUT - LREC 51 POSICOES --------------*            00099104
       01 WRK-DADOS.                                                    00100000
          05 WRK-ID         PIC 9(05) VALUE ZERO.                       00110000
          05 WRK-PRODUTO    PIC X(30) VALUE SPACES.                     00120000
          05 FILLER         PIC X(10) VALUE SPACES.                     00121002
          05 WRK-PRECO      PIC 9(06) VALUE ZERO.                       00123000
      *====================================================*            00124004
       PROCEDURE                                 DIVISION.              00125000
      *====================================================*            00126004
                                                                        00126104
           ACCEPT WRK-DADOS FROM SYSIN.                                 00127000
           DISPLAY 'ID........... ' WRK-ID.                             00128000
           DISPLAY 'PRODUTO...... ' WRK-PRODUTO.                        00129000
           DISPLAY 'PRECO........ ' WRK-PRECO.                          00140000
           STOP RUN.                                                    00160000
                                                                        00170004
      *----------------------------------------------------*            00180004
