      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
                                                                        00031002
       PROGRAM-ID. FR25CB07.                                            00040001
                                                                        00050000
      *===================================================*             00051003
      *  AUTOR: MURIEL RICARDO                            *             00052003
      *  EMPRESA: FOURSYS                                 *             00053003
      *---------------------------------------------------*             00054003
      *  DATA: 02/05/2022                                 *             00055004
      *  OBJETIVO: RECEBER VARIAVEIS ESTADO,              *             00056004
      *            ANO MES E DIA E EXIBI-LAS              *             00056104
      *            DE FORMA ORDENADA.                     *             00057004
      *                                                   *             00059003
      *===================================================*             00059103
                                                                        00091000
      *===================================================*             00092004
       ENVIRONMENT                               DIVISION.              00093000
      *===================================================*             00094004
                                                                        00095000
      *===================================================*             00096004
       DATA                                      DIVISION.              00097000
      *===================================================*             00098004
       WORKING-STORAGE                           SECTION.               00099004
      *----------- LAYOUT - LREC 08 POSICOES -------------*             00099104
       01 WRK-DATA.                                                     00100001
          05 WRK-ANO       PIC 9(04) VALUE ZEROS.                       00110001
          05 WRK-MES       PIC 9(02) VALUE ZEROS.                       00120001
          05 WRK-DIA       PIC 9(02) VALUE ZEROS.                       00121001
                                                                        00121104
      *===================================================*             00122004
       PROCEDURE                                 DIVISION.              00123001
      *===================================================*             00124004
                                                                        00124104
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.                          00125001
           DISPLAY 'SAO PAULO, ' WRK-DIA ' DE ' WRK-MES ' DE ' WRK-ANO. 00126001
           STOP RUN.                                                    00127001
                                                                        00128004
      *---------------------------------------------------*             00129004
