      *======================================================*          00010015
       IDENTIFICATION                               DIVISION.           00020014
      *======================================================*          00030015
                                                                        00031015
       PROGRAM-ID. FR25CB25.                                            00040003
                                                                        00050015
      *======================================================*          00060015
      *  AUTOR: MURIEL RICARDO                               *          00070015
      *  EMPRESA: FOURSYS                                    *          00080015
      *------------------------------------------------------*          00090015
      *  DATA: 10/05/2022                                    *          00091015
      *  OBJETIVO: APLICANDO CONHECIMENTOS SOBRE             *          00092015
      *            OPCAO UNTIL DO COMANDO PERFORM            *          00093015
      *            RECEBE VARIAVEIS NUERICAS E               *          00094015
      *            CALCULAR A TABUADA DAS MESMAS.            *          00095015
      *                                                      *          00096015
      *======================================================*          00097015
                                                                        00100000
      *======================================================*          00110015
       ENVIRONMENT                                  DIVISION.           00120014
      *======================================================*          00130015
                                                                        00130114
      *------------------------------------------------------*          00130215
       CONFIGURATION                                SECTION.            00131014
      *------------------------------------------------------*          00131115
                                                                        00131215
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT  IS COMMA.                                     00133000
                                                                        00134000
      *======================================================*          00135015
       DATA                                         DIVISION.           00136014
      *======================================================*          00137015
       WORKING-STORAGE                              SECTION.            00138014
      *----------- LAYOUT - LREC 02 POSICOES ----------------*          00138115
       01 WRK-DADOS.                                                    00139000
          05 WRK-NUMERO        PIC 9(02)    VALUE ZEROS.                00140000
                                                                        00141015
      *-----------  VALORES PARA ACUMULACAO  ----------------*          00150015
                                                                        00150115
       77 WRK-CONT-TIME        PIC 9(02)    VALUE 10.                   00150206
       77 WRK-CONT             PIC 9(02)    VALUE 1.                    00151000
       77 WRK-TOTAL            PIC 9(04)    VALUE ZEROS.                00152000
                                                                        00152114
      *======================================================*          00153015
       PROCEDURE                                    DIVISION.           00154014
      *======================================================*          00155015
      *------------------------------------------------------*          00156015
       0000-PRINCIPAL                               SECTION.            00157014
      *------------------------------------------------------*          00157115
                                                                        00157215
           PERFORM 1000-INICIALIZAR.                                    00157300
           IF WRK-NUMERO IS NUMERIC                                     00157415
             PERFORM 2000-PROCESSAR UNTIL WRK-NUMERO EQUAL 99           00157515
             PERFORM 3000-FINALIZAR                                     00157615
           ELSE                                                         00157715
             PERFORM 9000-TRATA-ERROS                                   00157815
           END-IF.                                                      00157915
           STOP RUN.                                                    00158001
                                                                        00158115
      *------------------------------------------------------*          00158215
       0000-99-FIM.                           EXIT.                     00158314
      *------------------------------------------------------*          00158415
                                                                        00158513
      *------------------------------------------------------*          00158615
       1000-INICIALIZAR                             SECTION.            00158714
      *------------------------------------------------------*          00158815
                                                                        00158913
           ACCEPT WRK-DADOS FROM SYSIN.                                 00159000
                                                                        00159113
      *------------------------------------------------------*          00159215
       1000-99-FIM.                           EXIT.                     00159314
      *------------------------------------------------------*          00159415
                                                                        00159500
      *------------------------------------------------------*          00159615
       2000-PROCESSAR                               SECTION.            00159714
      *------------------------------------------------------*          00159815
                                                                        00159913
           DISPLAY '----TABUADA DO ' WRK-NUMERO '----'.                 00160014
           PERFORM 2100-PROCESSAR WRK-CONT-TIME TIMES                   00160114
           MOVE 1 TO WRK-CONT.                                          00160214
           ACCEPT WRK-DADOS FROM SYSIN.                                 00160314
                                                                        00160413
      *------------------------------------------------------*          00160515
       2000-99-FIM.                          EXIT.                      00160614
      *------------------------------------------------------*          00160715
                                                                        00160813
      *------------------------------------------------------*          00160915
       2100-PROCESSAR                               SECTION.            00161014
      *------------------------------------------------------*          00161115
                                                                        00161213
           COMPUTE WRK-TOTAL = WRK-NUMERO * WRK-CONT.                   00161314
           DISPLAY WRK-NUMERO ' X ' WRK-CONT ' = ' WRK-TOTAL.           00161414
           ADD 1 TO WRK-CONT.                                           00161514
                                                                        00161613
      *------------------------------------------------------*          00161715
       2100-99-FIM.                          EXIT.                      00161814
      *------------------------------------------------------*          00161915
                                                                        00162013
      *------------------------------------------------------*          00162115
       3000-FINALIZAR                               SECTION.            00162214
      *------------------------------------------------------*          00162315
                                                                        00162413
            DISPLAY '---- FIM DO PROGRAMA ----'.                        00162513
                                                                        00162613
      *------------------------------------------------------*          00162715
       3000-99-FIM.                          EXIT.                      00163014
      *------------------------------------------------------*          00164015
                                                                        00165015
      *------------------------------------------------------*          00165115
       9000-TRATA-ERROS                             SECTION.            00165215
      *------------------------------------------------------*          00165315
                                                                        00165415
            DISPLAY 'SOMENTE NUMEROS SAO PERMITDOS'.                    00165615
                                                                        00169015
      *------------------------------------------------------*          00170015
       9000-99-FIM.                          EXIT.                      00180015
      *------------------------------------------------------*          00190015
