      *======================================================*          00010000
       IDENTIFICATION                               DIVISION.           00020000
      *======================================================*          00030000
                                                                        00031000
       PROGRAM-ID. FR25CB26.                                            00032000
                                                                        00033000
      *======================================================*          00034000
      *  AUTOR: MURIEL RICARDO                               *          00035000
      *  EMPRESA: FOURSYS                                    *          00036000
      *------------------------------------------------------*          00037000
      *  DATA: 10/05/2022                                    *          00038000
      *  OBJETIVO: RECEBER AS VARIAVEIS                      *          00039045
      *            MOSTRAR OS DADOS RECEBIDOS                *          00040000
      *            E O VALOR CORRIGIDO FIXO                  *          00050000
      *            DE 5% (JURO-COMPOSTO-MES SOBRE MES)       *          00060000
      *                                                      *          00070000
      *======================================================*          00080000
                                                                        00090000
      *======================================================*          00100000
       ENVIRONMENT                                  DIVISION.           00110000
      *======================================================*          00120000
                                                                        00130000
      *------------------------------------------------------*          00130100
       CONFIGURATION                                SECTION.            00130200
      *------------------------------------------------------*          00130300
                                                                        00130400
       SPECIAL-NAMES.                                                   00130500
           DECIMAL-POINT  IS COMMA.                                     00130600
                                                                        00130700
      *======================================================*          00130800
       DATA                                         DIVISION.           00130900
      *======================================================*          00131000
       WORKING-STORAGE                              SECTION.            00132000
      *----------- LAYOUT - LREC 18 POSICOES ----------------*          00133000
       01 WRK-DADOS.                                                    00134000
          05 WRK-AGENCIA       PIC 9(04)    VALUE ZEROS.                00135000
          05 WRK-CONTA         PIC 9(05)    VALUE ZEROS.                00136000
          05 WRK-VALOR         PIC 9(05)V99 VALUE ZEROS.                00136100
          05 WRK-MESES         PIC 9(02)    VALUE ZEROS.                00136200
                                                                        00136300
      *------------ VALORES PARA ACUMULACAO -----------------*          00137044
                                                                        00138000
       77 WRK-CONT             PIC 9(05)V99 VALUE ZEROS.                00138143
       77 WRK-VALOR-CORR       PIC 9(05)V99 VALUE ZEROS.                00139033
                                                                        00139319
      *------------  VARIAVEIS PARA EDICAO ------------------*          00139444
                                                                        00139500
       77 WRK-VALOR-ED         PIC    Z9.999,99.                        00140036
       77 WRK-VALOR-CORR-ED    PIC    Z9.999,99.                        00150036
                                                                        00151000
      *======================================================*          00152000
       PROCEDURE                                    DIVISION.           00153000
      *======================================================*          00154000
      *------------------------------------------------------*          00155000
       0000-PRINCIPAL                               SECTION.            00156000
      *------------------------------------------------------*          00157000
                                                                        00157100
           PERFORM 1000-INICIALIZAR.                                    00157200
           PERFORM 2000-PROCESSAR.                                      00157637
           PERFORM 3000-FINALIZAR.                                      00157740
           STOP RUN.                                                    00158100
                                                                        00158200
      *------------------------------------------------------*          00158300
       0000-99-FIM.                           EXIT.                     00158400
      *------------------------------------------------------*          00158500
                                                                        00158600
      *------------------------------------------------------*          00158700
       1000-INICIALIZAR                             SECTION.            00158800
      *------------------------------------------------------*          00158900
                                                                        00159000
           ACCEPT WRK-DADOS FROM SYSIN.                                 00159100
                                                                        00159200
      *------------------------------------------------------*          00159300
       1000-99-FIM.                           EXIT.                     00159400
      *------------------------------------------------------*          00159500
                                                                        00159600
      *------------------------------------------------------*          00159700
       2000-PROCESSAR                               SECTION.            00159800
      *------------------------------------------------------*          00159900
                                                                        00160020
            IF WRK-VALOR IS NUMERIC                                     00160642
              MOVE WRK-VALOR TO WRK-CONT                                00160743
              PERFORM 2100-PROCESSAR WRK-MESES TIMES                    00160842
              PERFORM 2200-PROCESSAR                                    00160942
            ELSE                                                        00161042
              PERFORM 9000-TRATA-ERROS                                  00161142
            END-IF.                                                     00161242
                                                                        00161335
      *------------------------------------------------------*          00161400
       2000-99-FIM.                           EXIT.                     00161543
      *------------------------------------------------------*          00161600
                                                                        00161737
      *------------------------------------------------------*          00161837
       2100-PROCESSAR                               SECTION.            00161937
      *------------------------------------------------------*          00162037
                                                                        00162137
            COMPUTE WRK-VALOR-CORR = WRK-CONT * 1,05.                   00162243
            MOVE WRK-VALOR-CORR TO WRK-CONT.                            00162343
                                                                        00162437
      *------------------------------------------------------*          00162537
       2100-99-FIM.                           EXIT.                     00162643
      *------------------------------------------------------*          00162737
                                                                        00162841
      *------------------------------------------------------*          00162941
       2200-PROCESSAR                               SECTION.            00163041
      *------------------------------------------------------*          00163141
                                                                        00163241
            MOVE WRK-VALOR TO WRK-VALOR-ED.                             00163342
            MOVE WRK-VALOR-CORR TO WRK-VALOR-CORR-ED.                   00163442
                                                                        00163541
            DISPLAY 'AGENCIA.......... ' WRK-AGENCIA.                   00163642
            DISPLAY 'CONTA............ ' WRK-CONTA.                     00163742
            DISPLAY 'VALOR............ R$' WRK-VALOR-ED.                00163842
            DISPLAY 'MESES............ ' WRK-MESES.                     00163942
            DISPLAY 'VALOR CORRIGIDO.. R$' WRK-VALOR-CORR-ED.           00164042
                                                                        00164141
      *------------------------------------------------------*          00164241
       2200-99-FIM.                           EXIT.                     00164343
      *------------------------------------------------------*          00164441
                                                                        00164500
      *------------------------------------------------------*          00164600
       3000-FINALIZAR                               SECTION.            00164700
      *------------------------------------------------------*          00164800
                                                                        00164942
            DISPLAY '------ FIM DO PROGRAMA ------'.                    00165042
                                                                        00165140
      *------------------------------------------------------*          00165900
       3000-99-FIM.                           EXIT.                     00166043
      *------------------------------------------------------*          00166100
                                                                        00166200
      *------------------------------------------------------*          00166300
       9000-TRATA-ERROS                             SECTION.            00166400
      *------------------------------------------------------*          00166500
                                                                        00166600
            DISPLAY 'SOMENTE NUMEROS SAO PERMITDOS'.                    00166700
                                                                        00166900
      *------------------------------------------------------*          00167000
       9000-99-FIM.                           EXIT.                     00167143
      *------------------------------------------------------*          00168000
