      *====================================================*            00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================*            00030000
                                                                        00040000
       PROGRAM-ID. FR25CB24.                                            00050000
                                                                        00060000
      *=======================================================*         00070000
      *  AUTOR: MURIEL RICARDO                                *         00080000
      *  EMPRESA: FOURSYS                                     *         00090000
      *-------------------------------------------------------*         00100000
      *  DATA: 10/05/2022                                     *         00100100
      *  OBJETIVO: APLICANDO CONHECIMENTOS SOBRE              *         00100200
      *            OPCAO UNTIL DO COMANDO PERFORM             *         00100300
      *            RECEBE VARIAVEIS, CALCULA A SOMA           *         00100400
      *            E LE A QUANTIDADE DE REGISTROS.            *         00100500
      *                                                       *         00100600
      *=======================================================*         00100800
                                                                        00100900
      *=======================================================*         00101000
       ENVIRONMENT                                  DIVISION.           00102000
      *=======================================================*         00103000
                                                                        00104000
      *-------------------------------------------------------*         00105000
       CONFIGURATION                                SECTION.            00106000
      *-------------------------------------------------------*         00107000
                                                                        00108000
       SPECIAL-NAMES.                                                   00109000
           DECIMAL-POINT IS COMMA.                                      00110000
                                                                        00120000
      *=======================================================*         00130000
       DATA                                         DIVISION.           00131000
      *=======================================================*         00132000
       WORKING-STORAGE                         SECTION.                 00133000
      *----------- LAYOUT - LREC 43 POSICOES -----------------*         00133111
       01 WRK-DADOS.                                                    00134000
          05 WRK-CODIGO        PIC 9(03)    VALUE ZEROS.                00135000
          05 WRK-ITEM          PIC X(30)    VALUE SPACES.               00136000
          05 WRK-VALOR         PIC 9(05)V99 VALUE ZEROS.                00136100
          05 WRK-QUANT         PIC 9(03)    VALUE ZEROS.                00136200
                                                                        00136311
      *----------- VALORES PARA ACUMULACAO  ------------------*         00138222
                                                                        00138311
       77 WRK-VALOR-TOTAL      PIC 9(06)V99 VALUE ZEROS.                00138411
       77 WRK-SOMA             PIC 9(06)V99 VALUE ZEROS.                00138511
       77 WRK-CONT             PIC 9(02)    VALUE 0.                    00139000
                                                                        00139111
      *-----------   VARIAVEIS PARA EDICAO  ------------------*         00139222
                                                                        00139311
       77 WRK-VALOR-TOTAL-ED   PIC Z99.999,99.                          00139404
       77 WRK-VALOR-ED         PIC  Z9.999,99.                          00139504
       77 WRK-SOMA-ED          PIC Z99.999,99.                          00139604
                                                                        00139700
      *=======================================================*         00140000
       PROCEDURE                                    DIVISION.           00150000
      *=======================================================*         00151000
                                                                        00152000
      *-------------------------------------------------------*         00153000
       0000-PRINCIPAL                               SECTION.            00154000
      *-------------------------------------------------------*         00155000
                                                                        00155107
            PERFORM 1000-INICIALIZAR.                                   00156007
            IF WRK-CODIGO NOT EQUAL ZEROS AND                           00156821
               WRK-VALOR NOT EQUAL ZEROS AND                            00156921
               WRK-QUANT NOT EQUAL ZEROS                                00157021
                PERFORM 2000-PROCESSAR UNTIL WRK-CODIGO EQUAL 999       00157121
                PERFORM 3000-FINALIZAR                                  00157221
            ELSE                                                        00157321
             PERFORM 9000-TRATA-ERROS                                   00158021
            END-IF.                                                     00158317
            STOP RUN.                                                   00158400
                                                                        00158500
      *-------------------------------------------------------*         00158600
       0000-99-FIM.                           EXIT.                     00158700
      *-------------------------------------------------------*         00158800
                                                                        00158900
      *-------------------------------------------------------*         00159000
       1000-INICIALIZAR                             SECTION.            00159100
           ACCEPT WRK-DADOS FROM SYSIN.                                 00159200
      *-------------------------------------------------------*         00159300
                                                                        00159400
      *-------------------------------------------------------*         00159500
       1000-99-FIM.                           EXIT.                     00159600
      *-------------------------------------------------------*         00159700
                                                                        00159800
      *-------------------------------------------------------*         00159900
       2000-PROCESSAR                               SECTION.            00160000
                                                                        00160100
                                                                        00160202
           ADD 1 TO WRK-CONT.                                           00160302
           COMPUTE WRK-VALOR-TOTAL = WRK-VALOR * WRK-QUANT.             00160404
           ADD WRK-VALOR-TOTAL TO WRK-SOMA.                             00160504
                                                                        00160604
           MOVE WRK-VALOR-TOTAL TO WRK-VALOR-TOTAL-ED.                  00160704
           MOVE WRK-VALOR TO WRK-VALOR-ED.                              00160802
           MOVE WRK-SOMA TO WRK-SOMA-ED.                                00160902
                                                                        00161002
           DISPLAY 'CODIGO.......   ' WRK-CODIGO.                       00161104
           DISPLAY 'ITEM.........   ' WRK-ITEM.                         00161204
           DISPLAY 'QUANT........   ' WRK-QUANT.                        00161304
           DISPLAY 'VALOR.UNIT...   R$ ' WRK-VALOR-ED.                  00161406
           DISPLAY 'VALOR.TOTAL..   R$' WRK-VALOR-TOTAL-ED.             00161505
           DISPLAY '----------------'.                                  00161604
                                                                        00161702
           ACCEPT WRK-DADOS FROM SYSIN.                                 00161800
                                                                        00161900
      *-------------------------------------------------------*         00162000
                                                                        00162100
      *-------------------------------------------------------*         00162200
       2000-99-FIM.                            EXIT.                    00162300
      *-------------------------------------------------------*         00162400
                                                                        00162500
      *-------------------------------------------------------*         00162600
       3000-FINALIZAR                               SECTION.            00162700
                                                                        00162800
           DISPLAY 'SOMA DOS VALORES.. R$' WRK-SOMA-ED.                 00162903
           DISPLAY 'REGISTROS LIDOS... ' WRK-CONT.                      00163000
           DISPLAY '------ FIM DO PROGRAMA---------'.                   00163100
      *-------------------------------------------------------*         00163200
                                                                        00163300
      *-------------------------------------------------------*         00163400
       3000-99-FIM.                           EXIT.                     00163500
      *-------------------------------------------------------*         00163600
                                                                        00163700
      *-------------------------------------------------------*         00165915
       9000-TRATA-ERROS                          SECTION.               00166021
      *-------------------------------------------------------*         00166115
                                                                        00166215
           IF WRK-CODIGO EQUAL ZEROS                                    00166316
            DISPLAY 'CAMPO "CODIGO" ESTA VAZIO'                         00166414
           END-IF.                                                      00166514
           IF WRK-VALOR EQUAL ZEROS                                     00166616
            DISPLAY 'CAMPO "VALOR" ESTA VAZIO'                          00166714
           END-IF.                                                      00166814
           IF WRK-QUANT EQUAL ZEROS                                     00166916
            DISPLAY 'CAMPO "QUANTIDADE" ESTA VAZIO'                     00167014
           END-IF.                                                      00167114
                                                                        00167213
      *-------------------------------------------------------*         00167300
       9000-99-FIM.                           EXIT.                     00167421
      *-------------------------------------------------------*         00168000
