      *====================================================*            00010001
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================*            00030001
                                                                        00031001
       PROGRAM-ID. FR25CB04.                                            00040001
                                                                        00050000
      *====================================================*            00060001
      *  AUTOR: MURIEL RICARDO                             *            00061001
      *  EMPRESA: FOURSYS                                  *            00062001
      *----------------------------------------------------*            00063001
      *  DATA: 27/04/2022                                  *            00064001
      *  OBJETIVO: RECEBER DADOS DA SYSIN E EXIBI-LOS      *            00065001
      *                                                    *            00066001
      *====================================================*            00067001
                                                                        00091000
      *====================================================*            00092001
       ENVIRONMENT                               DIVISION.              00093000
      *====================================================*            00094001
                                                                        00095000
      *====================================================*            00096001
       DATA                                      DIVISION.              00097000
      *====================================================*            00098001
       WORKING-STORAGE                           SECTION.               00099001
                                                                        00099101
       77 NOME        PICTURE X(20) VALUE SPACES.                       00100001
       77 SALARIO     PICTURE 9(05) VALUE ZEROS.                        00110001
                                                                        00120000
      *====================================================*            00130001
       PROCEDURE                                 DIVISION.              00140000
      *====================================================*            00150001
                                                                        00150101
           ACCEPT NOME    FROM SYSIN.                                   00151000
           ACCEPT SALARIO FROM SYSIN.                                   00152000
                                                                        00154001
           DISPLAY 'MEU NOME... '  NOME.                                00160000
           DISPLAY 'SALARIO...  ' SALARIO.                              00161000
           STOP RUN.                                                    00162000
                                                                        00162101
      *----------------------------------------------------*            00163001
