      *====================================================*            00010012
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================*            00030012
                                                                        00031012
       PROGRAM-ID. FR25CB22.                                            00040017
                                                                        00050000
      *====================================================*            00060012
      *  AUTOR: MURIEL RICARDO                                          00070015
      *  EMPRESA: FOURSYS                                               00080000
      *----------------------------------------------------*            00081012
      *  DATA: 06/05/2022                                  *            00082015
      *  OBJETIVO: RECEBER DADOS DA SYSIN                  *            00083012
      *            VERIFICAR SE O DADO "WRK-TIPO"          *            00084012
      *            E VALIDO. CASO SEJA, DEVE               *            00084112
      *            EXIBIR OS DADOS RECEBIDOS               *            00085012
      *            CASO NAO SEJAM VAÃLIDOS,                *            00086012
      *            DEVE EXIBIR 'REGISTRO NAO VALIDO".      *            00087012
      *====================================================*            00090012
                                                                        00100000
      *====================================================*            00110012
       ENVIRONMENT                               DIVISION.              00120000
      *====================================================*            00130012
                                                                        00130112
      *----------------------------------------------------*            00130212
       CONFIGURATION                             SECTION.               00131000
      *----------------------------------------------------*            00131112
                                                                        00131212
       SPECIAL-NAMES.                                                   00132000
           DECIMAL-POINT IS COMMA.                                      00133021
                                                                        00134012
      *====================================================*            00135012
       DATA                                      DIVISION.              00136000
      *====================================================*            00137012
                                                                        00137112
      *----------------------------------------------------*            00137212
       WORKING-STORAGE                           SECTION.               00138012
      *----------------------------------------------------*            00138112
                                                                        00138202
       01 WRK-DADOS.                                                    00139000
           05 WRK-DATA          PIC X(08)    VALUE SPACES.              00140002
           05 WRK-VALOR         PIC 9(05)V99 VALUE ZEROS.               00150002
           05 WRK-LANCAMENTO    PIC X(30)    VALUE SPACES.              00151002
           05 WRK-TIPO          PIC X(01)    VALUE SPACES.              00152002
              88 WRK-TIPO-VALIDO  VALUE 'C' 'D'.                        00154003
                                                                        00154116
       77 WRK-MSG               PIC X(20)    VALUE SPACES.              00154216
                                                                        00154318
      *----------------------------------------------------*            00154412
                                                                        00154500
       77 WRK-VALOR-ED    PIC 99.999,99.                                00154606
       77 WRK-DATA-ED     PIC 99/99/9999.                               00154709
                                                                        00154801
      *====================================================*            00154915
       PROCEDURE                                 DIVISION.              00155000
      *====================================================*            00155115
                                                                        00155222
      *----------------------------------------------------*            00155312
       0000-PRINCIPAL                            SECTION.               00155412
      *----------------------------------------------------*            00155512
                                                                        00155612
           PERFORM 0100-INICIAR.                                        00155716
           PERFORM 0200-PROCESSAR.                                      00155816
           PERFORM 0300-FINALIZAR.                                      00155916
           STOP RUN.                                                    00156012
                                                                        00156120
      *----------------------------------------------------*            00156220
       0000-99-FIM.                   EXIT.                             00156322
      *----------------------------------------------------*            00156420
                                                                        00156520
      *----------------------------------------------------*            00156612
       0100-INICIAR                              SECTION.               00156716
      *----------------------------------------------------*            00156812
                                                                        00156912
           ACCEPT WRK-DADOS FROM SYSIN.                                 00157000
                                                                        00157112
      *----------------------------------------------------*            00157212
       0100-99-FIM.                   EXIT.                             00157322
      *----------------------------------------------------*            00157412
                                                                        00157512
      *----------------------------------------------------*            00157612
       0200-PROCESSAR                            SECTION.               00157716
      *----------------------------------------------------*            00157812
                                                                        00157912
           IF NOT WRK-TIPO-VALIDO                                       00158018
              MOVE 'REGISTRO NAO VALIDO' TO WRK-MSG                     00159018
                 PERFORM 0900-TRATA-ERROS                               00159118
           ELSE                                                         00159218
                                                                        00159313
             MOVE WRK-DATA  TO WRK-DATA-ED                              00159818
             MOVE WRK-VALOR TO WRK-VALOR-ED                             00159918
                                                                        00160002
             DISPLAY 'DATA.........   ' WRK-DATA-ED                     00161018
             DISPLAY 'VALOR........   R$ ' WRK-VALOR-ED                 00170018
             DISPLAY 'LANCAMENTO...   ' WRK-LANCAMENTO                  00180018
                                                                        00180110
             IF WRK-TIPO = 'C'                                          00180218
                 DISPLAY 'TIPO.........   ' 'CREDITO'                   00180318
             ELSE                                                       00180418
                 DISPLAY 'TIPO.........   ' 'DEBITO'                    00180518
             END-IF                                                     00182718
           END-IF.                                                      00182818
                                                                        00182913
      *----------------------------------------------------*            00183012
       0200-99-FIM.                   EXIT.                             00183122
      *----------------------------------------------------*            00183212
                                                                        00183312
      *----------------------------------------------------*            00183412
       0300-FINALIZAR                            SECTION.               00183516
      *----------------------------------------------------*            00183612
                                                                        00183712
           DISPLAY '--------------------------'.                        00183823
           DISPLAY '---FIM DE PROCESSAMENTO---'.                        00183923
                                                                        00184012
      *----------------------------------------------------*            00184112
       0300-99-FIM.                   EXIT.                             00184222
      *----------------------------------------------------*            00184312
                                                                        00184420
      *----------------------------------------------------*            00184912
       0900-TRATA-ERROS                          SECTION.               00185016
      *----------------------------------------------------*            00185112
                                                                        00185212
           DISPLAY WRK-MSG.                                             00185323
                                                                        00185416
      *----------------------------------------------------*            00185512
       0900-99-FIM.                   EXIT.                             00186022
      *----------------------------------------------------*            00187012
