      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR25CB09.                                            00040000
                                                                        00050000
      *====================================================             00060000
      * AUTOR: MURIEL                                                   00070000
      * EMPRESA: FOURSYS                                                00080000
      *====================================================             00090000
                                                                        00091000
      *====================================================             00092000
       ENVIRONMENT                               DIVISION.              00093000
      *====================================================             00094000
                                                                        00095000
      *====================================================             00096000
       DATA                                      DIVISION.              00097000
      *====================================================             00098000
       WORKING-STORAGE                           SECTION.               00099000
                                                                        00100000
       01 WRK-DADOS.                                                    00110000
          05 WRK-ID        PIC 9(05) VALUE ZEROS.                       00120005
          05 WRK-NOME      PIC X(19) VALUE SPACES.                      00121024
          05 WRK-ENDERECO  PIC X(40) VALUE SPACES.                      00122005
                                                                        00126800
       01 WRK-DADOS-RED1   REDEFINES WRK-DADOS.                         00126918
          05 FILLER        PIC X(24).                                   00127024
          05 WRK-ENDERECOCOMP-RED1.                                     00127126
           1O FILLER       PIC X(40)                                    00127226
           10 WRK-BAIRRO-RED1 PIC X(10).                                00127326
           10 FILLER       PIC X(10).                                   00127425
                                                                        00127820
      *====================================================             00127900
       PROCEDURE                                 DIVISION.              00128000
      *====================================================             00128100
           ACCEPT WRK-DADOS FROM SYSIN.                                 00128206
           DISPLAY 'WRK-DADOS.......' WRK-DADOS.                        00128306
           DISPLAY 'WRK-DADOS-RED1..' WRK-ENDERECOCOMP-RED1.            00128425
           DISPLAY 'WRK-DADOS-RED2..' WRK-BAIRRO-RED1.                  00128526
           STOP RUN.                                                    00128606
      *====================================================             00129000
