      *====================================================*            00010005
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================*            00030005
                                                                        00031005
       PROGRAM-ID. FR25CB05.                                            00040001
                                                                        00050000
      *====================================================*            00051005
      *  AUTOR: MURIEL RICARDO                             *            00052005
      *  EMPRESA: FOURSYS                                  *            00053005
      *----------------------------------------------------*            00054005
      *  DATA: 28/04/2022                                  *            00055006
      *  OBJETIVO: RECEBER AS VARIAVEIS EM LINHA           *            00056005
      *            DA SISY E MOSTRAR OS DADOS RECEBIDOS    *            00057005
      *                                                    *            00058005
      *====================================================*            00059205
                                                                        00091000
      *====================================================*            00092005
       ENVIRONMENT                               DIVISION.              00093000
      *====================================================*            00094005
                                                                        00095000
      *====================================================*            00096005
       DATA                                      DIVISION.              00097000
      *====================================================*            00098005
       WORKING-STORAGE                            SECTION.              00099000
      *----------- LAYOUT - LREC 47 POSICOES --------------*            00099105
       01 WRK-DADOS.                                                    00100002
          05 WRK-CODIGO  PIC X(07) VALUE SPACES.                        00110002
          05 WRK-NOME    PIC X(23) VALUE SPACES.                        00120003
          05 WRK-AREA    PIC X(10) VALUE SPACES.                        00121002
          05 WRK-ESTADO  PIC X(02) VALUE SPACES.                        00122002
          05 WRK-SALARIO PIC 9(05) VALUE ZERO.                          00123002
                                                                        00124005
      *====================================================             00130000
       PROCEDURE                                 DIVISION.              00140000
      *====================================================             00150000
                                                                        00150105
           ACCEPT WRK-DADOS FROM SYSIN.                                 00151002
                                                                        00152005
           DISPLAY 'CODIGO.... ' WRK-CODIGO.                            00153004
           DISPLAY 'NOME...... ' WRK-NOME.                              00154004
           DISPLAY 'AREA...... ' WRK-AREA.                              00154104
           DISPLAY 'ESTADO.... ' WRK-ESTADO.                            00154204
           DISPLAY 'SALARIO... ' WRK-SALARIO.                           00154304
           STOP RUN.                                                    00155000
                                                                        00156005
      *----------------------------------------------------*            00157005
