      *====================================================*            00010001
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================*            00030001
                                                                        00040001
       PROGRAM-ID. FR25CB23.                                            00050006
                                                                        00060001
      *====================================================*            00070001
      *  AUTOR: MURIEL RICARDO                             *            00080004
      *  EMPRESA: FOURSYS                                  *            00090004
      *----------------------------------------------------*            00100001
      *  DATA: 06/05/2022                                  *            00100101
      *  OBJETIVO: TABUADA COM SOMA DE RESULTADOS          *            00100209
      *                                                    *            00100304
      *                                                    *            00100404
      *                                                    *            00100504
      *                                                    *            00100604
      *                                                    *            00101004
      *=======================================================*         00110004
                                                                        00120001
      *=======================================================*         00130004
       ENVIRONMENT                                  DIVISION.           00131004
      *=======================================================*         00132004
                                                                        00132103
      *-------------------------------------------------------*         00132204
       CONFIGURATION                                SECTION.            00132304
      *-------------------------------------------------------*         00132404
                                                                        00132503
       SPECIAL-NAMES.                                                   00132603
           DECIMAL-POINT IS COMMA.                                      00132703
                                                                        00132803
      *=======================================================*         00135004
       DATA                                         DIVISION.           00136004
      *=======================================================*         00137004
       WORKING-STORAGE                         SECTION.                 00138000
       01 WRK-DADOS.                                                    00139000
          05 WRK-NUMERO        PIC 9(02)    VALUE ZEROS.                00140000
          05 WRK-CONTTIMES     PIC 9(02)    VALUE ZEROS.                00150000
       77 WRK-CONT             PIC 9(02)    VALUE 10.                   00153008
       77 WRK-TOTAL            PIC 9(04)    VALUE ZEROS.                00154000
       77 WRK-TOTAL-SOMA       PIC 9(04)    VALUE 0.                    00154111
      *=======================================================*         00155004
       PROCEDURE                                    DIVISION.           00156004
      *=======================================================*         00157004
                                                                        00157104
      *-------------------------------------------------------*         00157204
       0000-PRINCIPAL                               SECTION.            00157304
      *-------------------------------------------------------*         00157404
                                                                        00157529
            PERFORM 1000-INICIALIZAR.                                   00157829
            PERFORM 2000-PROCESSAR WRK-CONTTIMES TIMES.                 00158229
            PERFORM 3000-FINALIZAR.                                     00158329
            STOP RUN.                                                   00158734
                                                                        00158804
      *-------------------------------------------------------*         00158904
       0000-99-FIM.                           EXIT.                     00159004
      *-------------------------------------------------------*         00159104
                                                                        00159204
      *-------------------------------------------------------*         00159304
       1000-INICIALIZAR                             SECTION.            00159404
           ACCEPT WRK-DADOS FROM SYSIN.                                 00159500
      *-------------------------------------------------------*         00159604
                                                                        00159704
      *-------------------------------------------------------*         00159804
       1000-99-FIM.                           EXIT.                     00159904
      *-------------------------------------------------------*         00160004
                                                                        00160100
      *-------------------------------------------------------*         00160204
       2000-PROCESSAR                               SECTION.            00160304
                                                                        00160400
           COMPUTE WRK-TOTAL = WRK-NUMERO * WRK-CONT.                   00161034
           DISPLAY WRK-NUMERO ' X ' WRK-CONT ' = ' WRK-TOTAL.           00161134
           SUBTRACT 1 FROM WRK-CONT.                                    00161234
           ADD WRK-TOTAL TO WRK-TOTAL-SOMA.                             00161334
                                                                        00161434
      *-------------------------------------------------------*         00161504
                                                                        00161604
      *-------------------------------------------------------*         00161704
       2000-99-FIM.                            EXIT.                    00161804
      *-------------------------------------------------------*         00161904
                                                                        00162004
      *-------------------------------------------------------*         00162104
       3000-FINALIZAR                               SECTION.            00162204
                                                                        00162320
           DISPLAY 'SOMA DOS RESULTADOS: ' WRK-TOTAL-SOMA               00162434
           DISPLAY '------ FIM DO PROGRAMA---------'.                   00162534
      *-------------------------------------------------------*         00162604
                                                                        00162704
      *-------------------------------------------------------*         00162804
       3000-99-FIM.                           EXIT.                     00162904
      *-------------------------------------------------------*         00163004
                                                                        00163121
      *-------------------------------------------------------*         00164034
       9000-TRATA-ERROS                          SECTION.               00164135
      *-------------------------------------------------------*         00164234
                                                                        00164321
      *-------------------------------------------------------*         00165034
       9000-99-FIM.                           EXIT.                     00166035
      *-------------------------------------------------------*         00167034
