      *====================================================             00010000
       IDENTIFICATION                            DIVISION.              00020000
      *====================================================             00030000
       PROGRAM-ID. FR25CB12.                                            00040000
                                                                        00050000
      *====================================================             00060000
      * AUTOR: MURIEL                                                   00070000
      * EMPRESA: FOURSYS                                                00080000
      *====================================================             00090000
                                                                        00091000
      *====================================================             00092000
       ENVIRONMENT                               DIVISION.              00093000
      *====================================================             00094000
                                                                        00095000
      *====================================================             00096000
       DATA                                      DIVISION.              00097000
      *====================================================             00098000
       WORKING-STORAGE                         SECTION.                 00099000
       01 WRK-DADOS.                                                    00100000
          05 WRK-N1         PIC 9(02) VALUE ZEROS.                      00110003
          05 WRK-N2         PIC 9(02) VALUE ZEROS.                      00120003
          05 WRK-N3         PIC 9(02) VALUE ZEROS.                      00120103
                                                                        00120205
       77 WRK-N4         PIC 9(02) VALUE 10.                            00120305
       77 WRK-RES        PIC 9(03) VALUE ZEROS.                         00121007
      *====================================================             00122000
       PROCEDURE                                 DIVISION.              00123000
      *====================================================             00124000
           ACCEPT WRK-DADOS FROM SYSIN.                                 00125000
           DISPLAY 'WRK-N1        ..  ' WRK-N1.                         00126000
           DISPLAY 'WRK-N2        ..  ' WRK-N2.                         00127000
           DISPLAY 'WRK-N3        ..  ' WRK-N3.                         00127100
            ADD WRK-N1 WRK-N2 WRK-N3 WRK-N4 TO WRK-RES.                 00127207
           DISPLAY 'WRK-RES       ..  ' WRK-RES.                        00127407
           STOP RUN.                                                    00127500
