//FOUR025X JOB 'COMP CO',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,01)
// JCLLIB  ORDER=GR.GERAL.PROCLIB
//COBCOMP  EXEC DFHCOBLB,LIB1=GR.FOUR025,NOME='MD022504',LIB2=GR.GERAL
//SYSTERM  DD  SYSOUT=*
//LKED.SYSIN    DD   *
  NAME MD022504(R) *
/*
