//FOUR025X JOB 'COMP DB2',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID
//*-------------------------------------------------------------------*
//*      JOB DE COMPILACAO DE PROGRAMA COBOL COM DB2 BATCH            *
//*      NAME = SEU PROGRAMA  -   INSTR = SUA CHAVE
//*-------------------------------------------------------------------*
//         JCLLIB ORDER=GR.GERAL.PROCLIB
//COMPDB2B EXEC DFHCODB2,NAME=FR25DB02,INSTR=FOUR025
//LKED.SYSIN    DD   *
  NAME FR25DB02(R)
//*
//BIND.SYSTSIN  DD *
 DSN  SYSTEM(DB8G)
 BIND PLAN(FR25DB02) MEM(FR25DB02) ACT(REP) ISOLATION(CS) -
       LIB('DSN810.DBRMLIB.DATA')
 END
