//FR25EXEC JOB 'EXE COB',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID              00010001
//STEP01   EXEC PGM=IEFBR14                                             00020000
//ARQUIVO  DD   DSN=GR.FOUR025.MASSASRT,DISP=(NEW,CATLG,DELETE),        00030001
//         SPACE=(TRK,(1,1)),DCB=(RECFM=FB,LRECL=41,BLKSIZE=27962)      00040000
