//FOUR025X JOB 'EXEC 02',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01)  00250006
//*EXECUTA  EXEC PGM=MD022502,PARM='R0027009990000001000'               00260020
//*EXECUTA  EXEC PGM=MD022502,PARM='L002700999'                         00260120
//EXECUTA  EXEC PGM=MD022502,PARM='G0555009990000023400'                00260220
//STEPLIB  DD   DSN=GR.GERAL.LOADLIB,DISP=SHR                           00270005
//EVSA0407 DD   DSN=GR.FOUR025.EVSA0407,DISP=SHR                        00280011
