//FOUR025X JOB 'EXEC 04',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01)  00010000
//EXECUTA  EXEC PGM=MD022504                                            00020000
//STEPLIB  DD   DSN=GR.GERAL.LOADLIB,DISP=SHR                           00040000
//EVSA0407 DD   DSN=GR.FOUR025.EVSA0407,DISP=SHR                        00050000
//MOV1207  DD   DSN=GR.FOUR025.MOV1207,DISP=OLD                         00060000
//EXC1207  DD   DSN=GR.FOUR025.EXCSAIDA(+1),DISP=(NEW,CATLG,DELETE),    00070005
//         LIKE=GR.FOUR025.MOV1207                                      00080006
