//FOUR025X JOB 'EXEC 03',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01)  00250001
//EXECUTA  EXEC PGM=MD022503,PARM='000100199055500999'                  00260208
//*EXECUTA  EXEC PGM=MD022503,PARM='000100199'                          00260308
//STEPLIB  DD   DSN=GR.GERAL.LOADLIB,DISP=SHR                           00270001
//EVSA0407 DD   DSN=GR.FOUR025.EVSA0407,DISP=SHR                        00280001
//SVSA0407 DD   DSN=GR.FOUR025.SVSA0407,DISP=OLD                        00281006
//*SVSA0407 DD   SYSOUT=*                                               00290006
