//FOUR025X JOB 'EXEC CO',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01)  00010020
//STEP01   EXEC PGM=MD022501                                            00140020
//STEPLIB  DD   DSN=GR.GERAL.LOADLIB,DISP=SHR                           00220001
//EVSA0407 DD   DSN=GR.IVAN.EVSA0407,DISP=SHR                           00220121
//SVSA0407 DD   DSN=GR.FOUR025.SVSA0407,DISP=OLD                        00220222
//*SVSA0407 DD   SYSOUT=*                                               00220322
