//FOUR025X JOB 'MURIEL',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID               00010000
//STEP01   EXEC PGM=IEFBR14                                             00020000
//CLIENTES DD  DSN=PR.FOUR025.CLIENTES,                                 00030000
//             DISP=(NEW,CATLG,DELETE),                                 00040000
//             SPACE=(TRK,(1,1)),                                       00050000
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)                    00060000
