//FOUR025X JOB 'EXEC COB',MSGCLASS=X,CLASS=C,NOTIFY=&SYSUID,TIME=(0,01) 00010000
//EXECUTAR EXEC PGM=CHAMAMES                                            00020000
//STEPLIB  DD DSN=PR.FOUR025.OBJ,DISP=SHR                               00030000
