//FOUR025X JOB 'SORT3',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP01   EXEC PGM=SORT
//SORTIN   DD   DSN=GR.FOUR025.MASSASRT,DISP=SHR
//SORTOUT  DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//*OUTREC FIELDS=(01:C'CONTA ',01,09,2X,34,08,30:C'_____________')
//*OUTREC FIELDS=(01:C'CONTA ',01,09,05,2X,34,08)
//SYSIN    DD  *
  SORT FIELDS=COPY
  OUTREC FIELDS=(10,19,X,C'SALDO ',34,08,X,C'-----')
